notes/leetcode_1649_create_sorted_array_through_instructions.org
:PROPERTIES:
:ID:       8539EBBB-376A-4102-A157-207DFF94E3AA
:ROAM_REFS: https://leetcode.com/problems/create-sorted-array-through-instructions/
:END:
#+TITLE: Leetcode: 1649. Create Sorted Array through Instructions
#+ROAM_REFS: https://leetcode.com/problems/create-sorted-array-through-instructions/
#+LEETCODE_LEVEL: Hard
#+ANKI_DECK: Problem Solving

- [[id:A18543C4-83BC-40F1-A243-B85FD935FAC0][Pattern: Answer query on sorted data]].  For each instructions, keep the previous instructions sorted and use [[id:1217FC3D-A9F9-49EC-BA5D-A68E50338DBD][Binary Search]] to compute the number of strictly less and greater.  Time complexity is $O(n \log n)$ and space is $O(n)$.

#+begin_src python
  from sortedcontainers import SortedList
  from typing import List


  class Solution:
      def createSortedArray(self, instructions: List[int]) -> int:
          MOD = 10**9 + 7
          N = len(instructions)
          s = SortedList()
          ans = 0
          for i in instructions:
              l = s.bisect_left(i)
              r = len(s) - s.bisect_left(i + 1)
              ans = (ans + min(l, r)) % MOD
              s.add(i)
          return ans
#+end_src
