leetcode_1649_create_sorted_array_through_instructions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 1649. Create Sorted Array through Instructions</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 1649. Create Sorted Array through Instructions</h1>
<p>
<a href="https://leetcode.com/problems/create-sorted-array-through-instructions/">Problem Statement</a>
</p>

<ul class="org-ul">
<li><a href="pattern_answer_query_on_sorted_data.html#ID-A18543C4-83BC-40F1-A243-B85FD935FAC0">Pattern: Answer query on sorted data</a>.  For each instructions, keep the previous instructions sorted and use <a href="binary_search.html#ID-1217FC3D-A9F9-49EC-BA5D-A68E50338DBD">Binary-search</a> to compute the number of strictly less and greater.  Time complexity is \(O(n \log n)\) and space is \(O(n)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> sortedcontainers <span style="font-weight: bold;">import</span> SortedList
<span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">createSortedArray</span>(<span style="font-weight: bold;">self</span>, instructions: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        MOD = 10**9 + 7
        <span style="font-weight: bold; font-style: italic;">N</span> = <span style="font-weight: bold;">len</span>(instructions)
        <span style="font-weight: bold; font-style: italic;">s</span> = SortedList()
        <span style="font-weight: bold; font-style: italic;">ans</span> = 0
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">instructions</span>:
            l = s.bisect_left(i)
            <span style="font-weight: bold; font-style: italic;">r</span> = <span style="font-weight: bold;">len</span>(s) - s.bisect_left(i + 1)
            <span style="font-weight: bold; font-style: italic;">ans</span> = (ans + <span style="font-weight: bold;">min</span>(l, r)) % MOD
            s.add(i)
        <span style="font-weight: bold;">return</span> ans
</pre>
</div>
</div>
</body>
</html>